2019-07-08 17:03:10.014684

Model file name: train_2500epochs
Training data: ~/data/shared/LaPlanteSims/v2/t21_snapshots_filtered.hdf5
Notes: Trying to track down bias. Batch 160. training for 2500 epochs.
Model Summary: 
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, None, None, 30)    0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, None, None, 32)    8672      
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, None, None, 32)    0         
_________________________________________________________________
batch_normalization_1 (Batch (None, None, None, 32)    128       
_________________________________________________________________
re_lu_1 (ReLU)               (None, None, None, 32)    0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, None, None, 64)    18496     
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, None, None, 64)    0         
_________________________________________________________________
batch_normalization_2 (Batch (None, None, None, 64)    256       
_________________________________________________________________
re_lu_2 (ReLU)               (None, None, None, 64)    0         
_________________________________________________________________
dropout_1 (Dropout)          (None, None, None, 64)    0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, None, None, 128)   73856     
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, None, None, 128)   0         
_________________________________________________________________
batch_normalization_3 (Batch (None, None, None, 128)   512       
_________________________________________________________________
re_lu_3 (ReLU)               (None, None, None, 128)   0         
_________________________________________________________________
dropout_2 (Dropout)          (None, None, None, 128)   0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, None, None, 256)   295168    
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, None, None, 256)   0         
_________________________________________________________________
batch_normalization_4 (Batch (None, None, None, 256)   1024      
_________________________________________________________________
re_lu_4 (ReLU)               (None, None, None, 256)   0         
_________________________________________________________________
dropout_3 (Dropout)          (None, None, None, 256)   0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, None, None, 3)     6915      
_________________________________________________________________
dropout_4 (Dropout)          (None, None, None, 3)     0         
_________________________________________________________________
global_max_pooling2d_1 (Glob (None, 3)                 0         
=================================================================
Total params: 405,027
Trainable params: 404,067
Non-trainable params: 960
_________________________________________________________________
